{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "activation": "relu", "batch_input_shape": [null, 28, 28, 1], "activity_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_size": [5, 5], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_1", "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "activation": "relu", "name": "conv2d_2", "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "strides": [1, 1], "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.5, "seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "units": 128, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"rate": 0.5, "seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "activation": "softmax", "activity_regularizer": null, "units": 10, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_2"}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}